In [1]:
import pandas as pd

1

In [11]:
data=pd.read_csv('E:/DataSets/input.csv')

In [13]:
data.head()

   id   name  salary  start_date        dept
0   1   Rick  623.30    1/1/2012          IT
1   2    Dan  515.20   9/23/2013  Operations
2   3  Tusar  611.00  11/15/2014          IT
3   4   Ryan  729.00   5/11/2014          HR
4   5   Gary  843.25   3/27/2015     Finance

In [15]:
data.head(7)

   id    name  salary  start_date        dept
0   1    Rick  623.30    1/1/2012          IT
1   2     Dan  515.20   9/23/2013  Operations
2   3   Tusar  611.00  11/15/2014          IT
3   4    Ryan  729.00   5/11/2014          HR
4   5    Gary  843.25   3/27/2015     Finance
5   6   Rasmi  578.00   5/21/2013          IT
6   7  Pranab  632.80   7/30/2013  Operations

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      int64
 1   name        8 non-null      object
 2   salary      8 non-null      float64
 3   start_date  8 non-null      object
 4   dept        8 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 452.0+ bytes

In [19]:
data.select_dtypes(include='object').nunique()

name          8
start_date    8
dept          4
dtype: int64

In [21]:
data.select_dtypes(include='float64').nunique()

salary    8
dtype: int64

In [23]:
data.select_dtypes(include='int64').nunique()

id    8
dtype: int64

In [25]:
data.isna().any()

id            False
name          False
salary        False
start_date    False
dept          False
dtype: bool

In [27]:
data.isnull().sum()

id            0
name          0
salary        0
start_date    0
dept          0
dtype: int64

In [29]:
data.isna().sum()

id            0
name          0
salary        0
start_date    0
dept          0
dtype: int64

In [31]:
data.describe()

            id      salary
count  8.00000    8.000000
mean   4.50000  656.881250
std    2.44949  103.059463
min    1.00000  515.200000
25%    2.75000  602.750000
50%    4.50000  628.050000
75%    6.25000  724.125000
max    8.00000  843.250000

In [33]:
data.describe(include=['object'])

        name start_date dept
count      8          8    8
unique     8          8    4
top     Rick   1/1/2012   IT
freq       1          1    3

In [35]:
data.describe(include='all')

             id  name      salary start_date dept
count   8.00000     8    8.000000          8    8
unique      NaN     8         NaN          8    4
top         NaN  Rick         NaN   1/1/2012   IT
freq        NaN     1         NaN          1    3
mean    4.50000   NaN  656.881250        NaN  NaN
std     2.44949   NaN  103.059463        NaN  NaN
min     1.00000   NaN  515.200000        NaN  NaN
25%     2.75000   NaN  602.750000        NaN  NaN
50%     4.50000   NaN  628.050000        NaN  NaN
75%     6.25000   NaN  724.125000        NaN  NaN
max     8.00000   NaN  843.250000        NaN  NaN

In [37]:
data.loc[[1,3,5]]

   id   name  salary start_date        dept
1   2    Dan   515.2  9/23/2013  Operations
3   4   Ryan   729.0  5/11/2014          HR
5   6  Rasmi   578.0  5/21/2013          IT

In [39]:
data[['name','salary']]

     name  salary
0    Rick  623.30
1     Dan  515.20
2   Tusar  611.00
3    Ryan  729.00
4    Gary  843.25
5   Rasmi  578.00
6  Pranab  632.80
7    Guru  722.50

In [41]:
data.loc[[1,3,5],['name','salary']]

    name  salary
1    Dan   515.2
3   Ryan   729.0
5  Rasmi   578.0

In [43]:
import pandas as pd
data=pd.read_json('E:/DataSets/input.json')
print("Preview the loaded data")
print(data)
print("Preview the loaded data")
print(data)
print("Filtering specific records and fields")
print (data.loc[[1,3,5],['salary','name']])

Preview the loaded data
   id    name  salary  start_date        dept
0   1    Rick  623.30    1/1/2012          IT
1   2     Dan  515.20   9/23/2013  Operations
2   3   Tusar  611.00  11/15/2014          IT
3   4    Ryan  729.00   5/11/2014          HR
4   5    Gary  843.25   3/27/2015     Finance
5   6   Rasmi  578.00   5/21/2013          IT
6   7  Pranab  632.80   7/30/2013  Operations
7   8    Guru  722.50   6/17/2014     Finance
Preview the loaded data
   id    name  salary  start_date        dept
0   1    Rick  623.30    1/1/2012          IT
1   2     Dan  515.20   9/23/2013  Operations
2   3   Tusar  611.00  11/15/2014          IT
3   4    Ryan  729.00   5/11/2014          HR
4   5    Gary  843.25   3/27/2015     Finance
5   6   Rasmi  578.00   5/21/2013          IT
6   7  Pranab  632.80   7/30/2013  Operations
7   8    Guru  722.50   6/17/2014     Finance
Filtering specific records and fields
   salary   name
1   515.2    Dan
3   729.0   Ryan
5   578.0  Rasmi

In [45]:
import pandas as pd
data=pd.read_json('E:/DataSets/input.json')
print("Preview the loaded data")
print(data)
print("Preview the first 5 lines of the loaded data")
print(data.head())
print("Filtering specific records and fields")
print (data.loc[[1,3,5],['salary','name']])

Preview the loaded data
   id    name  salary  start_date        dept
0   1    Rick  623.30    1/1/2012          IT
1   2     Dan  515.20   9/23/2013  Operations
2   3   Tusar  611.00  11/15/2014          IT
3   4    Ryan  729.00   5/11/2014          HR
4   5    Gary  843.25   3/27/2015     Finance
5   6   Rasmi  578.00   5/21/2013          IT
6   7  Pranab  632.80   7/30/2013  Operations
7   8    Guru  722.50   6/17/2014     Finance
Preview the first 5 lines of the loaded data
   id   name  salary  start_date        dept
0   1   Rick  623.30    1/1/2012          IT
1   2    Dan  515.20   9/23/2013  Operations
2   3  Tusar  611.00  11/15/2014          IT
3   4   Ryan  729.00   5/11/2014          HR
4   5   Gary  843.25   3/27/2015     Finance
Filtering specific records and fields
   salary   name
1   515.2    Dan
3   729.0   Ryan
5   578.0  Rasmi

In [47]:
!pip install xlrd

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [59]:
import pandas as pd

with pd.ExcelFile('E:/DataSets/inputsheets.xls') as xls:
    df1 = pd.read_excel(xls, 'Sheet1')
    df2 = pd.read_excel(xls, 'Sheet2')

print("Preview the loaded data: Sheet1")
print(df1)
print("Preview the loaded data: Sheet2")
print(df2)
print("Preview the first 5 lines of the loaded data: Sheet1")
print(df1.head())
print("Preview the first 5 lines of the loaded data: Sheet2")
print(df2.head())
print("Filtering specific records and fields: Sheet1")
print(df1.loc[[1,3,5],['name','salary']])
#print(df1.loc[[1,3,5],['salary','name']])
print("Filtering specific records and fields: Sheet2")
print(df2.loc[[1,3,5],['name','zipcode']])

Preview the loaded data: Sheet1
   id    name  salary start_date        dept
0   1    Rick  623.30 2012-01-01          IT
1   2     Dan  515.20 2013-09-23  Operations
2   3   Tusar  611.00 2014-11-15          IT
3   4    Ryan  729.00 2014-05-11          HR
4   5    Gary  843.25 2015-03-27     Finance
5   6   Rasmi  578.00 2013-05-21          IT
6   7  Pranab  632.80 2013-07-30  Operations
7   8    Guru  722.50 2014-06-17     Finance
Preview the loaded data: Sheet2
   id    name  zipcode
0   1    Rick   301224
1   2     Dan   341255
2   3   Tusar   297704
3   4    Ryan   216650
4   5    Gary   438700
5   6   Rasmi   665100
6   7  Pranab   341211
7   8    Guru   347480
Preview the first 5 lines of the loaded data: Sheet1
   id   name  salary start_date        dept
0   1   Rick  623.30 2012-01-01          IT
1   2    Dan  515.20 2013-09-23  Operations
2   3  Tusar  611.00 2014-11-15          IT
3   4   Ryan  729.00 2014-05-11          HR
4   5   Gary  843.25 2015-03-27     Finance
Preview the first 5 lines of the loaded data: Sheet2
   id   name  zipcode
0   1   Rick   301224
1   2    Dan   341255
2   3  Tusar   297704
3   4   Ryan   216650
4   5   Gary   438700
Filtering specific records and fields: Sheet1
    name  salary
1    Dan   515.2
3   Ryan   729.0
5  Rasmi   578.0
Filtering specific records and fields: Sheet2
    name  zipcode
1    Dan   341255
3   Ryan   216650
5  Rasmi   665100

In [ ]:
2

In [61]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\acer\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\acer\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\acer\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [63]:
from sqlalchemy import create_engine

In [65]:
database = create_engine('sqlite:///:memory:')

In [67]:
data.to_sql('emp', database)

8

In [69]:
res1 = pd.read_sql_query('SELECT * FROM emp', database)
print('Result 1')
print(res1)
print('')

Result 1
   index  id    name  salary  start_date        dept
0      0   1    Rick  623.30    1/1/2012          IT
1      1   2     Dan  515.20   9/23/2013  Operations
2      2   3   Tusar  611.00  11/15/2014          IT
3      3   4    Ryan  729.00   5/11/2014          HR
4      4   5    Gary  843.25   3/27/2015     Finance
5      5   6   Rasmi  578.00   5/21/2013          IT
6      6   7  Pranab  632.80   7/30/2013  Operations
7      7   8    Guru  722.50   6/17/2014     Finance

In [77]:
res2 = pd.read_sql_query('SELECT dept,sum(salary) FROM emp group by dept',database)
print('Result 2')
print(res2)

Result 2
         dept  sum(salary)
0     Finance      1565.75
1          HR       729.00
2          IT      1812.30
3  Operations      1148.00

In [79]:
res3 = pd.read_sql_query('SELECT dept,avg(salary) FROM emp group by dept',database)
print('Result 3')
print(res3)

Result 3
         dept  avg(salary)
0     Finance      782.875
1          HR      729.000
2          IT      604.100
3  Operations      574.000

In [81]:
res4 = pd.read_sql_query('SELECT dept,count(*) Number_of_Employees,min(salary),max(salary) FROM emp group by dept', database)
print('Result 4')

Result 4

In [83]:
print(res4)

         dept  Number_of_Employees  min(salary)  max(salary)
0     Finance                    2        722.5       843.25
1          HR                    1        729.0       729.00
2          IT                    3        578.0       623.30
3  Operations                    2        515.2       632.80

In [ ]:
3

In [85]:
!pip install mysql
!pip install mysql-connector

Collecting mysql
  Downloading mysql-0.0.3-py3-none-any.whl.metadata (746 bytes)
Collecting mysqlclient (from mysql)
  Downloading mysqlclient-2.2.6-cp312-cp312-win_amd64.whl.metadata (4.8 kB)
Downloading mysql-0.0.3-py3-none-any.whl (1.2 kB)
Downloading mysqlclient-2.2.6-cp312-cp312-win_amd64.whl (207 kB)
Installing collected packages: mysqlclient, mysql
Successfully installed mysql-0.0.3 mysqlclient-2.2.6
Collecting mysql-connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
     ---------------------------------------- 0.0/11.9 MB ? eta -:--:--
     ---------------------------------------- 0.0/11.9 MB ? eta -:--:--
      --------------------------------------- 0.3/11.9 MB ? eta -:--:--
     - ------------------------------------- 0.5/11.9 MB 762.0 kB/s eta 0:00:15
     - ------------------------------------- 0.5/11.9 MB 762.0 kB/s eta 0:00:15
     - ------------------------------------- 0.5/11.9 MB 762.0 kB/s eta 0:00:15
     -- ------------------------------------ 0.8/11.9 MB 644.9 kB/s eta 0:00:18
     -- ------------------------------------ 0.8/11.9 MB 644.9 kB/s eta 0:00:18
     -- ------------------------------------ 0.8/11.9 MB 644.9 kB/s eta 0:00:18
     --- ----------------------------------- 1.0/11.9 MB 518.8 kB/s eta 0:00:21
     --- ----------------------------------- 1.0/11.9 MB 518.8 kB/s eta 0:00:21
     ---- ---------------------------------- 1.3/11.9 MB 524.3 kB/s eta 0:00:21
     ----- --------------------------------- 1.6/11.9 MB 570.6 kB/s eta 0:00:19
     ----- --------------------------------- 1.6/11.9 MB 570.6 kB/s eta 0:00:19
     ------ -------------------------------- 1.8/11.9 MB 585.1 kB/s eta 0:00:18
     ------ -------------------------------- 1.8/11.9 MB 585.1 kB/s eta 0:00:18
     ------ -------------------------------- 1.8/11.9 MB 585.1 kB/s eta 0:00:18
     ------ -------------------------------- 2.1/11.9 MB 543.7 kB/s eta 0:00:18
     ------ -------------------------------- 2.1/11.9 MB 543.7 kB/s eta 0:00:18
     ------ -------------------------------- 2.1/11.9 MB 543.7 kB/s eta 0:00:18
     ------ -------------------------------- 2.1/11.9 MB 543.7 kB/s eta 0:00:18
     ------ -------------------------------- 2.1/11.9 MB 543.7 kB/s eta 0:00:18
     ------- ------------------------------- 2.4/11.9 MB 489.9 kB/s eta 0:00:20
     ------- ------------------------------- 2.4/11.9 MB 489.9 kB/s eta 0:00:20
     ------- ------------------------------- 2.4/11.9 MB 489.9 kB/s eta 0:00:20
     ------- ------------------------------- 2.4/11.9 MB 489.9 kB/s eta 0:00:20
     -------- ------------------------------ 2.6/11.9 MB 453.4 kB/s eta 0:00:21
     -------- ------------------------------ 2.6/11.9 MB 453.4 kB/s eta 0:00:21
     -------- ------------------------------ 2.6/11.9 MB 453.4 kB/s eta 0:00:21
     -------- ------------------------------ 2.6/11.9 MB 453.4 kB/s eta 0:00:21
     --------- ----------------------------- 2.9/11.9 MB 439.2 kB/s eta 0:00:21
     --------- ----------------------------- 2.9/11.9 MB 439.2 kB/s eta 0:00:21
     --------- ----------------------------- 2.9/11.9 MB 439.2 kB/s eta 0:00:21
     ---------- ---------------------------- 3.1/11.9 MB 424.2 kB/s eta 0:00:21
     ---------- ---------------------------- 3.1/11.9 MB 424.2 kB/s eta 0:00:21
     ---------- ---------------------------- 3.1/11.9 MB 424.2 kB/s eta 0:00:21
     ----------- --------------------------- 3.4/11.9 MB 427.4 kB/s eta 0:00:20
     ----------- --------------------------- 3.4/11.9 MB 427.4 kB/s eta 0:00:20
     ----------- --------------------------- 3.4/11.9 MB 427.4 kB/s eta 0:00:20
     ------------ -------------------------- 3.7/11.9 MB 430.2 kB/s eta 0:00:20
     ------------ -------------------------- 3.7/11.9 MB 430.2 kB/s eta 0:00:20
     ------------ -------------------------- 3.7/11.9 MB 430.2 kB/s eta 0:00:20
     ------------ -------------------------- 3.9/11.9 MB 423.2 kB/s eta 0:00:19
     ------------ -------------------------- 3.9/11.9 MB 423.2 kB/s eta 0:00:19
     ------------ -------------------------- 3.9/11.9 MB 423.2 kB/s eta 0:00:19
     ------------- ------------------------- 4.2/11.9 MB 422.2 kB/s eta 0:00:19
     ------------- ------------------------- 4.2/11.9 MB 422.2 kB/s eta 0:00:19
     -------------- ------------------------ 4.5/11.9 MB 431.6 kB/s eta 0:00:18
     -------------- ------------------------ 4.5/11.9 MB 431.6 kB/s eta 0:00:18
     --------------- ----------------------- 4.7/11.9 MB 440.1 kB/s eta 0:00:17
     --------------- ----------------------- 4.7/11.9 MB 440.1 kB/s eta 0:00:17
     --------------- ----------------------- 4.7/11.9 MB 440.1 kB/s eta 0:00:17
     --------------- ----------------------- 4.7/11.9 MB 440.1 kB/s eta 0:00:17
     ---------------- ---------------------- 5.0/11.9 MB 430.8 kB/s eta 0:00:16
     ---------------- ---------------------- 5.0/11.9 MB 430.8 kB/s eta 0:00:16
     ---------------- ---------------------- 5.0/11.9 MB 430.8 kB/s eta 0:00:16
     ---------------- ---------------------- 5.0/11.9 MB 430.8 kB/s eta 0:00:16
     ----------------- --------------------- 5.2/11.9 MB 423.3 kB/s eta 0:00:16
     ----------------- --------------------- 5.2/11.9 MB 423.3 kB/s eta 0:00:16
     ------------------ -------------------- 5.5/11.9 MB 430.2 kB/s eta 0:00:15
     ------------------ -------------------- 5.5/11.9 MB 430.2 kB/s eta 0:00:15
     ------------------ -------------------- 5.5/11.9 MB 430.2 kB/s eta 0:00:15
     ------------------ -------------------- 5.8/11.9 MB 429.1 kB/s eta 0:00:15
     ------------------ -------------------- 5.8/11.9 MB 429.1 kB/s eta 0:00:15
     ------------------- ------------------- 6.0/11.9 MB 433.2 kB/s eta 0:00:14
     ------------------- ------------------- 6.0/11.9 MB 433.2 kB/s eta 0:00:14
     -------------------- ------------------ 6.3/11.9 MB 440.0 kB/s eta 0:00:13
     --------------------- ----------------- 6.6/11.9 MB 446.9 kB/s eta 0:00:12
     --------------------- ----------------- 6.6/11.9 MB 446.9 kB/s eta 0:00:12
     ---------------------- ---------------- 6.8/11.9 MB 452.9 kB/s eta 0:00:12
     ----------------------- --------------- 7.1/11.9 MB 465.0 kB/s eta 0:00:11
     ----------------------- --------------- 7.1/11.9 MB 465.0 kB/s eta 0:00:11
     ------------------------ -------------- 7.3/11.9 MB 471.9 kB/s eta 0:00:10
     ------------------------- ------------- 7.6/11.9 MB 481.8 kB/s eta 0:00:09
     ------------------------- ------------- 7.6/11.9 MB 481.8 kB/s eta 0:00:09
     -------------------------- ------------ 8.1/11.9 MB 497.3 kB/s eta 0:00:08
     --------------------------- ----------- 8.4/11.9 MB 506.4 kB/s eta 0:00:07
     ---------------------------- ---------- 8.7/11.9 MB 517.7 kB/s eta 0:00:07
     ------------------------------- ------- 9.4/11.9 MB 556.6 kB/s eta 0:00:05
     ------------------------------- ------- 9.7/11.9 MB 568.7 kB/s eta 0:00:04
     -------------------------------- ----- 10.2/11.9 MB 590.3 kB/s eta 0:00:03
     ---------------------------------- --- 10.7/11.9 MB 612.3 kB/s eta 0:00:02
     ----------------------------------- -- 11.0/11.9 MB 620.8 kB/s eta 0:00:02
     ------------------------------------ - 11.5/11.9 MB 642.4 kB/s eta 0:00:01
     -------------------------------------  11.8/11.9 MB 649.2 kB/s eta 0:00:01
     -------------------------------------- 11.9/11.9 MB 650.1 kB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py): started
  Building wheel for mysql-connector (setup.py): finished with status 'done'
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp312-cp312-win_amd64.whl size=247959 sha256=80163d6c094117f2e5973373f75b14f7b44519421a13a4a129ca114e574856e8
  Stored in directory: c:\users\acer\appdata\local\pip\cache\wheels\03\17\fa\d7604c72dd3dd6d3eb3d249abf36cc532c9a9b4354b8f1bc4f
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [21]:
import mysql.connector as con

In [6]:
db=con.connect( host = 'localhost',
database = 'mysql',
user = 'root', 
password = '')

cur = db.cursor()

cur.execute( " show databases " )

for row in cur.fetchall():
    print(row[0])
    
db.close()

information_schema
light
mysql
performance_schema
phpmyadmin
test

In [3]:
# Importing the MySQL Connector module For Connecting To MySQL database
import mysql.connector as con

# To establish a connection to the database
db=con.connect( host = 'localhost', 
             database = 'student',
             user = 'root', 
             password = '')
"""
#You must create a Cursor object.
#It will let you execute all the queries you need
"""
cur = db.cursor()

# Use all the SQL you like
cur.execute( " CREATE TABLE IF NOT EXISTS students2 ( stud_id varchar(10) PRIMARY KEY, stud_name VARCHAR(215), address VARCHAR(215), city char(100)) ")

cur.execute( " show tables " )

for row in cur.fetchall():
    print(row[0])
    
db.close()

ProgrammingError: 1049 (42000): Unknown database 'student'

In [15]:
import sqlite3
con = sqlite3.connect(":memory:")
cur = con.cursor()
cur.execute("create table people (name, age)")
who = "Yeltsin"
age = 72
# This is the qmark style:
12
cur.execute("insert into people values (?, ?)", (who, age))
# And this is the named style:
cur.execute("select * from people where name=:who and age=:age", {"who": who,"age": age})
print(cur.fetchone())
con.close()

('Yeltsin', 72)